# Exploratory Data Analysis

## SQL

In [1]:
import pandas as pd

%load_ext sql

Establish a connection to the data base before you run the following cell:
Create a text file called **.env** containing

> PGSQL_USER=USERNAME  \
> PGSQL_PASSWORD= PASSWORD 

**Note:** I (Cannur) created .env file with my credentials so you do not need to create it. You can run it directly.

In [2]:
from dotenv import load_dotenv
import os

load_dotenv()
username = os.getenv('PGSQL_USER')
password = os.getenv('PGSQL_PASSWORD')
hostname = 'gip.itc.utwente.nl'
portname = '5434'
databasename = 'c211'

%sql postgresql://{username}:{password}@{hostname}:{portname}/{databasename}

Now, we can find the database has how many rows.

In [3]:
%sql \
select count(*) as Row_Counts\
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(2530161,)]

Now, we can see the first 3 rows.

In [4]:
%%sql 
Select * from vw_observation2017
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(1755950, '441', '5639', datetime.date(2017, 3, 18), 36552, 227, 618, '15:28', 33989999),
 (1457662, '619', '5639', datetime.date(2017, 4, 1), 43145, 270, 569, '16:23', 33990000),
 (1457664, '70', '5639', datetime.date(2017, 4, 1), 43145, 270, 569, '15:44', 33990004)]

We can see the first 3 rows for the other tables.

In [5]:
%%sql 
Select * from vw_myblock
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(44608, 202, 318, '01030000204071000001000000050000000000000080A8084100000000C06813410000000080A80841000000006078134100000000C0C70841000000006078134100000000C0C7084100000000C06813410000000080A8084100000000C0681341', '870134'),
 (44609, 177, 310, '010300002040710000010000000500000000000000409B054100000000C0EB124100000000409B05410000000060FB12410000000080BA05410000000060FB12410000000080BA054100000000C0EB124100000000409B054100000000C0EB1241', '870135'),
 (44610, 174, 314, '010300002040710000010000000500000000000000803D054100000000402A134100000000803D054100000000E039134100000000C05C054100000000E039134100000000C05C054100000000402A134100000000803D054100000000402A1341', '870136')]

In [6]:
%%sql 
Select * from vw_myblocklanduse
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(60, 'Hoofdweg', 1, 6537.33085031952),
 (60, 'Landbouw', 1, 871977.654549437),
 (60, 'Recreatie', 1, 39618.6174416008)]

In [7]:
%%sql 
Select * from vw_roadlengths
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(2, '0103000020407100000100000005000000000000000088C3400000000080AE1741000000000088C3400000000020BE174100000000007CC5400000000020BE174100000000007CC5400000000080AE1741000000000088C3400000000080AE1741', 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0),
 (3, '0103000020407100000100000005000000000000000088C3400000000020BE1741000000000088C34000000000C0CD174100000000007CC54000000000C0CD174100000000007CC5400000000020BE1741000000000088C3400000000020BE1741', 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0),
 (4, '0103000020407100000100000005000000000000000088C34000000000C0CD1741000000000088C3400000000060DD174100000000007CC5400000000060DD174100000000007CC54000000000C0CD1741000000000088C34000000000C0CD1741', 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0)]

In [8]:
%%sql 
Select * from precipitation
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(48471, 20170322, 52.0525, 5.62822, 0.0, '010100002040710000684FCD9D5FF00441CDD2039862901B41', 23313),
 (48471, 20170323, 52.0525, 5.62822, 0.0, '010100002040710000684FCD9D5FF00441CDD2039862901B41', 23313),
 (48471, 20170324, 52.0525, 5.62822, 0.0, '010100002040710000684FCD9D5FF00441CDD2039862901B41', 23313)]

In [9]:
%%sql 
Select * from temperature
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(21944, 20170424, 51.2509, 3.80463, 15.0413, '0101000020407100009634E9AF99BCE540883057F634311641', 1439),
 (21944, 20170425, 51.2509, 3.80463, 10.3514, '0101000020407100009634E9AF99BCE540883057F634311641', 1439),
 (21944, 20170614, 51.2509, 3.80463, 26.1349, '0101000020407100009634E9AF99BCE540883057F634311641', 1439)]

In [10]:
%%sql 
Select * from block_demography
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(167, 18, 375, '0103000020407100000100000005000000000000000094D1400000000060E31641000000000094D1400000000000F3164100000000008ED2400000000000F3164100000000008ED2400000000060E31641000000000094D1400000000060E31641', 5, 115, 1005, 1755, 4275, 8715, 9390, 9565),
 (168, 18, 376, '0103000020407100000100000005000000000000000094D1400000000000F31641000000000094D14000000000A002174100000000008ED24000000000A002174100000000008ED2400000000000F31641000000000094D1400000000000F31641', 10, 450, 1070, 1725, 3885, 6915, 9220, 9525),
 (169, 18, 377, '0103000020407100000100000005000000000000000094D14000000000A0021741000000000094D140000000004012174100000000008ED240000000004012174100000000008ED24000000000A0021741000000000094D14000000000A0021741', 0, 475, 625, 1660, 1885, 6515, 7420, 9345)]

In [11]:
%%sql 
Select * from block_road_access
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(60, 'W', 1, 900.48733374501),
 (61, 'W', 1, 1656.38376965095),
 (62, 'G', 1, 656.363163271632)]

In [12]:
%%sql 
Select * from days
Limit 3

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
3 rows affected.

[(20170102, datetime.date(2017, 1, 2), 2, 1, False),
 (20170103, datetime.date(2017, 1, 3), 3, 2, False),
 (20170104, datetime.date(2017, 1, 4), 4, 3, False)]

We can find: 
- how many observer, 
- different species and 
- different blocks.

In [13]:
%%sql 
Select count(distinct observer) as Number_of_Observer
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(11805,)]

In [14]:
%%sql 
Select count(distinct species) as Number_of_Species
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(464,)]

In [15]:
%%sql 
Select count(distinct block) as Number_of_block
from vw_observation2017

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(33535,)]

We can check the null cells.

In [16]:
%%sql 
select count(*) 
from vw_observation2017 
where id isnull or 
 species isnull or 
 observer isnull or
 obsdate isnull or 
 block isnull or 
 longit isnull or
 latit isnull or
 obstime isnull or
 idd isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(450421,)]

In [17]:
%%sql 
select count(*) 
from vw_observation2017 
where obstime isnull

 * postgresql://s2495929:***@gip.itc.utwente.nl:5434/c211
1 rows affected.

[(450421,)]

## DASK

We can explore the data with **DASK**.

In [2]:
import dask.dataframe as dd

In [3]:
df_observation2017 = dd.read_sql_table('vw_observation2017', 'postgresql://s2495929:_s2495929_@gip.itc.utwente.nl:5434/c211', index_col='id')
df_observation2017.head()

        species observer     obsdate  block  longit  latit obstime       idd
id
3350712     379    11416  2017-02-25   9497     111    503   14:11  33964540
3020628     715    11416  2017-06-19  12609     126    499   07:00  33964541
3100683      91    11416  2017-01-04  11538     121    501   17:10  33964542
3020625     111    11416  2017-06-19  12609     126    499   06:40  33964543
3100684     257    11416  2017-01-04  11538     121    501   17:09  33964544

In [4]:
df_days = dd.read_sql_table('days', 'postgresql://s2495929:_s2495929_@gip.itc.utwente.nl:5434/c211', index_col='mdate')
df_days=df_days.reset_index(drop=False)
df_days.head()

      mdate       odate  doy  dow  natholiday
0  20170102  2017-01-02    2    1       False
1  20170103  2017-01-03    3    2       False
2  20170104  2017-01-04    4    3       False
3  20170105  2017-01-05    5    4       False
4  20170106  2017-01-06    6    5       False

Merge 2 dataframes (observation2017 and days) using left join function

In [5]:
merged_1 = dd.merge(left=df_observation2017, right=df_days, how='left', left_on='obsdate', right_on='odate').drop('obsdate', axis=1)
merged_1.head()

,species,observer,block,longit,latit,obstime,idd,mdate,odate,doy,dow,natholiday
0,379,11416,9497,111,503,14:11,33964540,20170225,2017-02-25,56,6,False
1,715,11416,12609,126,499,07:00,33964541,20170619,2017-06-19,170,1,False
2,91,11416,11538,121,501,17:10,33964542,20170104,2017-01-04,4,3,False
3,111,11416,12609,126,499,06:40,33964543,20170619,2017-06-19,170,1,False
4,257,11416,11538,121,501,17:09,33964544,20170104,2017-01-04,4,3,False

Merge 2 dataframes (merged_1 and precipitation) using left join function

In [6]:
df_precipitation = dd.read_sql_table('precipitation', 'postgresql://s2495929:_s2495929_@gip.itc.utwente.nl:5434/c211', index_col='id')
df_precipitation.head()

/usr/local/lib/python3.8/dist-packages/dask/dataframe/io/sql.py:113: SAWarning: Did not recognize type 'geometry' of column 'corner'
  table = sa.Table(table, m, autoload=True, autoload_with=engine, schema=schema)

,dtime,lat,lon,precip,corner,block
id,,,,,,
22840,20170101,51.2771,3.74639,4.695590,010100002040710000121094F388C8E34097490E2B1760...,1184
22840,20170103,51.2771,3.74639,1.071720,010100002040710000121094F388C8E34097490E2B1760...,1184
22840,20170105,51.2771,3.74639,0.000000,010100002040710000121094F388C8E34097490E2B1760...,1184
22840,20170107,51.2771,3.74639,0.882307,010100002040710000121094F388C8E34097490E2B1760...,1184
22840,20170109,51.2771,3.74639,7.195980,010100002040710000121094F388C8E34097490E2B1760...,1184

In [7]:
merged_2 = dd.merge(left=merged_1, right=df_precipitation[['dtime', 'precip', 'block']], how='left', left_on= ['mdate', 'block'], right_on=['dtime', 'block'])
merged_2.head()

,species,observer,block,longit,latit,obstime,idd,mdate,odate,doy,dow,natholiday,dtime,precip
0,68,14398,44639,207,431,13:31,34024565,20170529,2017-05-29,149,1,False,NaN,NaN
1,336,14398,44666,206,433,09:37,34024637,20170409,2017-04-09,99,0,False,NaN,NaN
2,599,14398,44639,207,431,08:35,34024674,20170326,2017-03-26,85,0,False,NaN,NaN
3,257,14398,44666,206,433,09:38,34025318,20170409,2017-04-09,99,0,False,NaN,NaN
4,106,14398,44639,207,431,13:32,34025436,20170529,2017-05-29,149,1,False,NaN,NaN

Merge 2 dataframes (merged_2 and temperature) using left join function

In [8]:
df_temperature = dd.read_sql_table('temperature', 'postgresql://s2495929:_s2495929_@gip.itc.utwente.nl:5434/c211', index_col='id')
df_temperature.head()

/usr/local/lib/python3.8/dist-packages/dask/dataframe/io/sql.py:113: SAWarning: Did not recognize type 'geometry' of column 'corner'
  table = sa.Table(table, m, autoload=True, autoload_with=engine, schema=schema)

,dtime,lat,lon,temper,corner,block
id,,,,,,
5577,20170123,50.7668,5.70659,0.054152,0101000020407100002BED4808EFAB0541E1111C8DC0D5...,43440
5585,20170123,50.7665,5.81999,0.048270,010100002040710000DDADF4DCF6A50641A6EB4A4AC0D5...,43595
5591,20170123,50.7661,5.90504,0.092090,01010000204071000081189F127D61074184C005EFBFD5...,43740
5592,20170123,50.7660,5.91921,0.102427,010100002040710000FCD20EDBBD80074194FD8873C1D5...,43764
5593,20170123,50.7660,5.93339,0.113425,0101000020407100008907C7F8FE9F074171725F59C0D5...,43788

In [9]:
merged_3 = dd.merge(left=merged_2, right=df_temperature[['dtime', 'temper', 'block']], how='left', left_on= ['mdate', 'block'], right_on=['dtime', 'block'])
merged_3.tail()

,species,observer,block,longit,latit,obstime,idd,mdate,odate,doy,dow,natholiday,dtime_x,precip,dtime_y,temper
506485,815,11416,13664,131,493,19:49,33964337,20170426,2017-04-26,116,3,False,20170426.0,1.26457,20170426.0,10.52500
506486,815,11416,13664,131,493,19:49,33964339,20170426,2017-04-26,116,3,False,20170426.0,1.26457,20170426.0,10.52500
506487,638,11416,9495,111,501,16:47,33964356,20170201,2017-02-01,32,3,False,20170201.0,2.08926,20170201.0,6.29920
506488,92,11416,9279,110,480,10:15,33964477,20170110,2017-01-10,10,2,False,20170110.0,0.85380,20170110.0,7.39737
506489,638,11416,11751,122,500,14:35,33964506,20170311,2017-03-11,70,6,False,20170311.0,0.00000,20170311.0,12.01290

Merge 2 dataframes (merged_3 and demography) using left join function

In [12]:
df_demography = dd.read_sql_table('block_demography', 'postgresql://s2495929:_s2495929_@gip.itc.utwente.nl:5434/c211', index_col='block')
df_demography = df_demography.reset_index(drop=False)
df_demography.head()

/usr/local/lib/python3.8/dist-packages/dask/dataframe/io/sql.py:113: SAWarning: Did not recognize type 'geometry' of column 'geom'
  table = sa.Table(table, m, autoload=True, autoload_with=engine, schema=schema)

,block,longit,latit,geom,pop001,pop009,pop025,pop049,pop081,pop121,pop169,pop225
0,167,18,375,0103000020407100000100000005000000000000000094...,5,115,1005,1755,4275,8715,9390,9565
1,168,18,376,0103000020407100000100000005000000000000000094...,10,450,1070,1725,3885,6915,9220,9525
2,169,18,377,0103000020407100000100000005000000000000000094...,0,475,625,1660,1885,6515,7420,9345
3,170,18,378,0103000020407100000100000005000000000000000094...,5,415,615,1210,1725,2305,7005,7545
4,171,18,379,0103000020407100000100000005000000000000000094...,0,30,555,1055,1270,2080,2785,7095

In [13]:
merged_4 = dd.merge(left=merged_3, right=df_demography[['block', 'pop001', 'pop009', 'pop025', 'pop049', 'pop081', 'pop121', 'pop169', 'pop225']], how='left', left_on= 'block', right_on='block')
merged_4.head()

,species,observer,block,longit,latit,obstime,idd,mdate,odate,doy,...,dtime_y,temper,pop001,pop009,pop025,pop049,pop081,pop121,pop169,pop225
0,362,30239,44687,264,498,11:54,34076342,20170407,2017-04-07,97,...,NaN,NaN,0.0,65.0,120.0,195.0,785.0,1135.0,3335.0,7310.0
1,206,40713,44713,175,321,08:13,34077027,20170228,2017-02-28,59,...,NaN,NaN,415.0,1935.0,15580.0,40225.0,93960.0,122090.0,138635.0,151575.0
2,380,40713,44713,175,321,08:15,34077114,20170228,2017-02-28,59,...,NaN,NaN,415.0,1935.0,15580.0,40225.0,93960.0,122090.0,138635.0,151575.0
3,30,40713,44713,175,321,08:55,34077166,20170321,2017-03-21,80,...,NaN,NaN,415.0,1935.0,15580.0,40225.0,93960.0,122090.0,138635.0,151575.0
4,491,40713,44713,175,321,07:50,34077273,20170314,2017-03-14,73,...,NaN,NaN,415.0,1935.0,15580.0,40225.0,93960.0,122090.0,138635.0,151575.0

In [ ]:
# %time df_observation2017.block.max().compute()

In [ ]:
#x = df.describe()
#x.visualize(filename='observation2017.svg')

In [ ]:
# list(df_observation2017.columns)

In [ ]:
# df_observation2017.dtypes

In [14]:
(len(df_observation2017), df_observation2017.shape[1])

(2530161, 8)

In [15]:
(len(merged_4), merged_4.shape[1])

(2530161, 24)